Fraunhofer-AISEC/hbs-lms-rust/res/nrf52-arm/nrf52840_2.svd
        <register>
          <name>RXADDRESSES</name>
          <description>Receive address select</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR0</name>
              <description>Enable or disable reception on logical address 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR1</name>
              <description>Enable or disable reception on logical address 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR2</name>
              <description>Enable or disable reception on logical address 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR3</name>
              <description>Enable or disable reception on logical address 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR4</name>
              <description>Enable or disable reception on logical address 4.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR5</name>
              <description>Enable or disable reception on logical address 5.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR6</name>
              <description>Enable or disable reception on logical address 6.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR7</name>
              <description>Enable or disable reception on logical address 7.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCNF</name>
          <description>CRC configuration</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEN</name>
              <description>CRC length in number of bytes.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRC length is zero and CRC calculation is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>One</name>
                  <description>CRC length is one byte and CRC calculation is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Two</name>
                  <description>CRC length is two bytes and CRC calculation is enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Three</name>
                  <description>CRC length is three bytes and CRC calculation is enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIPADDR</name>
              <description>Include or exclude packet address field out of CRC calculation.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Include</name>
                  <description>CRC calculation includes address field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Skip</name>
                  <description>CRC calculation does not include address field. The CRC calculation will start at the first byte after the address.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ieee802154</name>
                  <description>CRC calculation as per 802.15.4 standard. Starting at first byte after length field.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPOLY</name>
          <description>CRC polynomial</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCINIT</name>
          <description>CRC initial value</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRCINIT</name>
              <description>CRC initial value</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFS</name>
          <description>Interframe spacing in us</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIFS</name>
              <description>Interframe spacing in us</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSISAMPLE</name>
          <description>RSSI sample</description>
          <addressOffset>0x548</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RSSISAMPLE</name>
              <description>RSSI sample</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Current radio state</description>
          <addressOffset>0x550</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>Current radio state</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RADIO is in the Disabled state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxRu</name>
                  <description>RADIO is in the RXRU state</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxIdle</name>
                  <description>RADIO is in the RXIDLE state</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx</name>
                  <description>RADIO is in the RX state</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxDisable</name>
                  <description>RADIO is in the RXDISABLED state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxRu</name>
                  <description>RADIO is in the TXRU state</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxIdle</name>
                  <description>RADIO is in the TXIDLE state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx</name>
                  <description>RADIO is in the TX state</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxDisable</name>
                  <description>RADIO is in the TXDISABLED state</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAWHITEIV</name>
          <description>Data whitening initial value</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>DATAWHITEIV</name>
              <description>Data whitening initial value. Bit 6 is hard-wired to '1', writing '0' to it has no effect, and it will always be read back and used by the device as '1'.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BCC</name>
          <description>Bit counter compare</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCC</name>
              <description>Bit counter compare</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DAB[%s]</name>
          <description>Description collection[n]: Device address base segment n</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAB</name>
              <description>Device address base segment n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DAP[%s]</name>
          <description>Description collection[n]: Device address prefix n</description>
          <addressOffset>0x620</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAP</name>
              <description>Device address prefix n</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DACNF</name>
          <description>Device address match configuration</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENA0</name>
              <description>Enable or disable device address matching using device address 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA1</name>
              <description>Enable or disable device address matching using device address 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA2</name>
              <description>Enable or disable device address matching using device address 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA3</name>
              <description>Enable or disable device address matching using device address 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA4</name>
              <description>Enable or disable device address matching using device address 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA5</name>
              <description>Enable or disable device address matching using device address 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA6</name>
              <description>Enable or disable device address matching using device address 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA7</name>
              <description>Enable or disable device address matching using device address 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXADD0</name>
              <description>TxAdd for device address 0</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TXADD1</name>
              <description>TxAdd for device address 1</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>TXADD2</name>
              <description>TxAdd for device address 2</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>TXADD3</name>
              <description>TxAdd for device address 3</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>TXADD4</name>
              <description>TxAdd for device address 4</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TXADD5</name>
              <description>TxAdd for device address 5</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>TXADD6</name>
              <description>TxAdd for device address 6</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>TXADD7</name>
              <description>TxAdd for device address 7</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MHRMATCHCONF</name>
          <description>Search pattern configuration</description>
          <addressOffset>0x644</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>MHRMATCHMAS</name>
          <description>Pattern mask</description>
          <addressOffset>0x648</addressOffset>
          <access>read-write</access>
        </register>
