Fraunhofer-AISEC/hbs-lms-rust/res/nrf52-arm/nrf52840_2.svd
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>UART_PSEL</headerStructName>
          <addressOffset>0x508</addressOffset>
          <register>
            <name>RTS</name>
            <description>Pin select for RTS</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXD</name>
            <description>Pin select for TXD</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTS</name>
            <description>Pin select for CTS</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RXD</name>
            <description>Pin select for RXD</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>RXD</name>
          <description>RXD register</description>
          <addressOffset>0x518</addressOffset>
          <access>read-only</access>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>RXD</name>
              <description>RX data received in previous transfers, double buffered</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXD</name>
          <description>TXD register</description>
          <addressOffset>0x51C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXD</name>
              <description>TX data to be transferred</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUDRATE</name>
          <description>Baud rate. Accuracy depends on the HFCLK source selected.</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <fields>
            <field>
              <name>BAUDRATE</name>
              <description>Baud rate</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Baud1200</name>
                  <description>1200 baud (actual rate: 1205)</description>
                  <value>0x0004F000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud2400</name>
                  <description>2400 baud (actual rate: 2396)</description>
                  <value>0x0009D000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud4800</name>
                  <description>4800 baud (actual rate: 4808)</description>
                  <value>0x0013B000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud9600</name>
                  <description>9600 baud (actual rate: 9598)</description>
                  <value>0x00275000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud14400</name>
                  <description>14400 baud (actual rate: 14414)</description>
                  <value>0x003B0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud19200</name>
                  <description>19200 baud (actual rate: 19208)</description>
                  <value>0x004EA000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud28800</name>
                  <description>28800 baud (actual rate: 28829)</description>
                  <value>0x0075F000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud31250</name>
                  <description>31250 baud</description>
                  <value>0x00800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud38400</name>
                  <description>38400 baud (actual rate: 38462)</description>
                  <value>0x009D5000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud56000</name>
                  <description>56000 baud (actual rate: 55944)</description>
                  <value>0x00E50000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud57600</name>
                  <description>57600 baud (actual rate: 57762)</description>
                  <value>0x00EBF000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud76800</name>
                  <description>76800 baud (actual rate: 76923)</description>
                  <value>0x013A9000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud115200</name>
                  <description>115200 baud (actual rate: 115942)</description>
                  <value>0x01D7E000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud230400</name>
                  <description>230400 baud (actual rate: 231884)</description>
                  <value>0x03AFB000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud250000</name>
                  <description>250000 baud</description>
                  <value>0x04000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud460800</name>
                  <description>460800 baud (actual rate: 470588)</description>
                  <value>0x075F7000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud921600</name>
                  <description>921600 baud (actual rate: 941176)</description>
                  <value>0x0EBED000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud1M</name>
                  <description>1Mega baud</description>
                  <value>0x10000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration of parity and hardware flow control</description>
          <addressOffset>0x56C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HWFC</name>
              <description>Hardware flow control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARITY</name>
              <description>Parity</description>
              <lsb>1</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Exclude parity bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Include parity bit</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
