Fraunhofer-AISEC/hbs-lms-rust/res/nrf52-arm/nrf52840_2.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <name>SPI1</name>
      <description>Serial Peripheral Interface 1</description>
      <baseAddress>0x40004000</baseAddress>
      <interrupt>
        <name>SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1</name>
        <value>4</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIM0">
      <name>SPIM1</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <baseAddress>0x40004000</baseAddress>
      <alternatePeripheral>SPI1</alternatePeripheral>
      <interrupt>
        <name>SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1</name>
        <value>4</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIS0">
      <name>SPIS1</name>
      <description>SPI Slave 1</description>
      <baseAddress>0x40004000</baseAddress>
      <alternatePeripheral>SPI1</alternatePeripheral>
      <interrupt>
        <name>SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1</name>
        <value>4</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWI0">
      <name>TWI1</name>
      <description>I2C compatible Two-Wire Interface 1</description>
      <baseAddress>0x40004000</baseAddress>
      <alternatePeripheral>SPI1</alternatePeripheral>
      <interrupt>
        <name>SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1</name>
        <value>4</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIM0">
      <name>TWIM1</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <baseAddress>0x40004000</baseAddress>
      <alternatePeripheral>SPI1</alternatePeripheral>
      <interrupt>
        <name>SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1</name>
        <value>4</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TWIS0">
      <name>TWIS1</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <baseAddress>0x40004000</baseAddress>
      <alternatePeripheral>SPI1</alternatePeripheral>
      <interrupt>
        <name>SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1</name>
        <value>4</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>NFCT</name>
      <description>NFC-A compatible radio</description>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>NFCT</name>
        <value>5</value>
      </interrupt>
      <groupName>NFCT</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_ACTIVATE</name>
          <description>Activate NFCT peripheral for incoming and outgoing frames, change state to activated</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_ACTIVATE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DISABLE</name>
          <description>Disable NFCT peripheral</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DISABLE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_SENSE</name>
          <description>Enable NFC sense field mode, change state to sense mode</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_SENSE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTTX</name>
          <description>Start transmission of an outgoing frame, change state to transmit</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTTX</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ENABLERXDATA</name>
          <description>Initializes the EasyDMA for receive.</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_ENABLERXDATA</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_GOIDLE</name>
          <description>Force state machine to IDLE state</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_GOIDLE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_GOSLEEP</name>
          <description>Force state machine to SLEEP_A state</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_GOSLEEP</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_READY</name>
          <description>The NFCT peripheral is ready to receive and send frames</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_READY</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_FIELDDETECTED</name>
          <description>Remote NFC field detected</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_FIELDDETECTED</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_FIELDLOST</name>
          <description>Remote NFC field lost</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_FIELDLOST</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TXFRAMESTART</name>
          <description>Marks the start of the first symbol of a transmitted frame</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_TXFRAMESTART</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TXFRAMEEND</name>
          <description>Marks the end of the last transmitted on-air symbol of a frame</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_TXFRAMEEND</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXFRAMESTART</name>
          <description>Marks the end of the first symbol of a received frame</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXFRAMESTART</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXFRAMEEND</name>
          <description>Received data has been checked (CRC, parity) and transferred to RAM, and EasyDMA has ended accessing the RX buffer</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXFRAMEEND</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ERROR</name>
          <description>NFC error reported. The ERRORSTATUS register contains details on the source of the error.</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ERROR</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RXERROR</name>
          <description>NFC RX frame error reported. The FRAMESTATUS.RX register contains details on the source of the error.</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_RXERROR</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ENDRX</name>
          <description>RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full.</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ENDRX</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ENDTX</name>
          <description>Transmission of data in RAM has ended, and EasyDMA has ended accessing the TX buffer</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ENDTX</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_AUTOCOLRESSTARTED</name>
          <description>Auto collision resolution process has started</description>
          <addressOffset>0x138</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_AUTOCOLRESSTARTED</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_COLLISION</name>
          <description>NFC auto collision resolution error reported.</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_COLLISION</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SELECTED</name>
          <description>NFC auto collision resolution successfully completed</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SELECTED</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STARTED</name>
          <description>EasyDMA is ready to receive or send frames.</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_STARTED</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORTS</name>
          <description>Shortcut register</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FIELDDETECTED_ACTIVATE</name>
              <description>Shortcut between FIELDDETECTED event and ACTIVATE task</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIELDLOST_SENSE</name>
              <description>Shortcut between FIELDLOST event and SENSE task</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFRAMEEND_ENABLERXDATA</name>
              <description>Shortcut between TXFRAMEEND event and ENABLERXDATA task</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
