Fraunhofer-AISEC/hbs-lms-rust/res/nrf52-arm/nrf52840_2.svd
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR30</name>
                <description>Subregion 30 in region n (write '1' to clear)</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No write access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Write access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR31</name>
                <description>Subregion 31 in region n (write '1' to clear)</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No write access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Write access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SUBSTATRA</name>
            <description>Description cluster[n]: Source of event/interrupt in region n, read access detected while corresponding subregion was enabled for watching</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
            <fields>
              <field>
                <name>SR0</name>
                <description>Subregion 0 in region n (write '1' to clear)</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR1</name>
                <description>Subregion 1 in region n (write '1' to clear)</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR2</name>
                <description>Subregion 2 in region n (write '1' to clear)</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR3</name>
                <description>Subregion 3 in region n (write '1' to clear)</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR4</name>
                <description>Subregion 4 in region n (write '1' to clear)</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR5</name>
                <description>Subregion 5 in region n (write '1' to clear)</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR6</name>
                <description>Subregion 6 in region n (write '1' to clear)</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR7</name>
                <description>Subregion 7 in region n (write '1' to clear)</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR8</name>
                <description>Subregion 8 in region n (write '1' to clear)</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR9</name>
                <description>Subregion 9 in region n (write '1' to clear)</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR10</name>
                <description>Subregion 10 in region n (write '1' to clear)</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR11</name>
                <description>Subregion 11 in region n (write '1' to clear)</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR12</name>
                <description>Subregion 12 in region n (write '1' to clear)</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR13</name>
                <description>Subregion 13 in region n (write '1' to clear)</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR14</name>
                <description>Subregion 14 in region n (write '1' to clear)</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR15</name>
                <description>Subregion 15 in region n (write '1' to clear)</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR16</name>
                <description>Subregion 16 in region n (write '1' to clear)</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR17</name>
                <description>Subregion 17 in region n (write '1' to clear)</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR18</name>
                <description>Subregion 18 in region n (write '1' to clear)</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR19</name>
                <description>Subregion 19 in region n (write '1' to clear)</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR20</name>
                <description>Subregion 20 in region n (write '1' to clear)</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR21</name>
                <description>Subregion 21 in region n (write '1' to clear)</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR22</name>
                <description>Subregion 22 in region n (write '1' to clear)</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR23</name>
                <description>Subregion 23 in region n (write '1' to clear)</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR24</name>
                <description>Subregion 24 in region n (write '1' to clear)</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR25</name>
                <description>Subregion 25 in region n (write '1' to clear)</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR26</name>
                <description>Subregion 26 in region n (write '1' to clear)</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR27</name>
                <description>Subregion 27 in region n (write '1' to clear)</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoAccess</name>
                    <description>No read access occurred in this subregion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Access</name>
                    <description>Read access(es) occurred in this subregion</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
